Revit 2024 API
StructuralSectionLProfileWithLips Class
 Defines parameters for L Profile with lips structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class StructuralSectionLProfileWithLips : StructuralSectionGeneralLA
Visual Basic
Public Class StructuralSectionLProfileWithLips _
	Inherits StructuralSectionGeneralLA
Visual C++
public ref class StructuralSectionLProfileWithLips : public StructuralSectionGeneralLA
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLA
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfileWithLips
See Also
StructuralSectionLProfileWithLips Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace